{
    "_name_or_path": "bert-base-cased",
    "architectures": ["BertForTokenClassification"],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
        "0": "0",
        "1": "Task",
        "2": "Domain_Data",
        "3": "Activity",
        "4": "Stakeholder",
        "5": "System_Function",
        "6": "Interaction",
        "7": "Interaction_Data",
        "8": "Workspace",
        "9": "System_Level"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
        "0": 0,
        "Activity": 3,
        "Domain_Data": 2,
        "Interaction": 6,
        "Interaction_Data": 7,
        "Stakeholder": 4,
        "System_Function": 5,
        "System_Level": 9,
        "Task": 1,
        "Workspace": 8
    },
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "torch_dtype": "float32",
    "transformers_version": "4.29.2",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 28996
}
