{
    "_name_or_path": "bert-base-cased",
    "architectures": ["BertForTokenClassification"],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "id2label": {
        "0": "0",
        "1": "Activity",
        "2": "Domain_Level",
        "3": "Interaction_Level",
        "4": "System_Level"
    },
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "label2id": {
        "0": 0,
        "Activity": 1,
        "Domain_Level": 2,
        "Interaction_Level": 3,
        "System_Level": 4
    },
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "torch_dtype": "float32",
    "transformers_version": "4.29.2",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 28996
}
